--协议说明
    --参考龙虎斗，桌子上没有用户，客户端自己控制不显示即可

    -- 0-9，共10个球
    Cards = {
        0,1,2,3,4,5,6,7,8,9
    }

    -- 押注方位
    Places = {
        One = 1, --1
        Two = 2, --2
        Three =3, --3
        Four = 4, --4
        Five = 5, --5
        Six = 6, --6
        Seven = 7, -- 7
        Eight = 8, --8
        Nine = 9, --9
        Zero = 10, --10 代表方位0
        ELEVEN = 11, -- 1~4
        Twelve = 12, -- 5
        Thirteen = 13, -- 5-9
    }

    deskInfo = {
        chips = {10, 50, 100, 500, 1000, 5000, 10000},  --筹码列表
        round ={
            bets = {0, 1000, 100,0,0,0,0,0,0,0,0,0,0},       --桌子各位置押注总额
            chips = {{0,0,1,0,0,0,0},{0,0,0,2,0,0,0},{0,0,0,2,0,0,0},{0,0,0,2,0,0,0},{0,0,0,2,0,0,0},{0,0,0,2,0,0,0},{0,0,0,2,0,0,0},{0,0,0,2,0,0,0},{0,0,0,2,0,0,0},{0,0,0,2,0,0,0},{0,0,0,2,0,0,0},{0,0,0,2,0,0,0},{0,0,0,2,0,0,0}},     --各位置各筹码数
        },
        state = 1,  --桌子状态(1:空闲，2：押注，3：结算)
        time = 5, --当前状态倒计时
        users = {}, --桌上6个玩家的列表(客户端暂不用处理)
        user = {    --我自己的信息
            coin = 1000,
            round = {
                bets = {100, 1000, 100,0,0,0,0,0,0,0,0,0,0}, --玩家各区域当前下注总额
                totalbet = 0,       --当前轮次总下注额
                wincoin = 0,        --当前轮次总赢分
            }
        },
        records = {}, --记录列表
        playercnt = 10, --房间玩家数
    }

--通知类：
     --空闲阶段
    {
        c = BET_STATE_FREE(128000),   
        time = 1,
        users = {}, --桌上6个玩家的列表
    }
    --下注阶段
    {
        c = BET_STATE_BETTING(128001), 
        time = 18,
    }
    --结算阶段
    {
        c = BET_STATE_SETTLE(128002),  
        time = 9,
        result = {
            ball= 9, --出的球
            res = 9,  --1-9:标识方位1-9; 10:表示方位0；11:标识1~4; 12:表示0/5; 13:表示6~9
        },
        user = {    --我自己的信息
            coin = 1000,
            wincoin = 100,
        }
    }
    --其他玩家下注(如果uid>0，说明是桌上玩家，从玩家头像飞金币； 如果uid=0，说明是列表里的玩家，从列表处飞金币，列表里的玩家每1秒同步一次，因此收到消息后在一秒内分多次飞金币)     
    {
        c = BET_USER_BET(128003),
        uid = uid,
        chips = {{0,0,1,0,0,0,0},{0,0,0,2,0,0,0},{0,0,0,2,0,0,0},...},  --各区域各筹码的数量
    }

--交互类
    --玩家下注(C->S) 不要太频繁，可以等玩家点完几次后再一次性上传
    {
        c = 37,
        uid = uid,
        chips = {{0,0,1,0,0,0,0},{0,0,0,2,0,0,0},{0,0,0,2,0,0,0},...},  --各区域各筹码的数量
    }
    --返回
    {
       c = 37,
       spcode = 0, --spcode不为0表示下注失败，前端从桌面移除筹码即可
       uid = uid,
       chips = {{0,0,1,0,0,0,0},{0,0,0,2,0,0,0},{0,0,0,2,0,0,0},...},  --各区域各筹码的数量
       bets = {100,200,100} --玩家各区域当前下注总额，spcode==0时带下来
    }
